       01  PRM-FLAGS.
           05  PRM-TEST-MODE        PIC X VALUE 'N'.
               88  PRM-TEST-YES     VALUE 'Y'.
           05  PRM-DATE-CUTOFF      PIC 9(8).
           05  PRM-ALLOW-NEGATIVE   PIC X VALUE 'N'.
               88  PRM-ALLOW-NEG    VALUE 'Y'.
