       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACCREC-STUB.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY ACCREC.
       PROCEDURE DIVISION.
           GOBACK.
