       IDENTIFICATION DIVISION.
       PROGRAM-ID. PARAMS-STUB.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY PARAMS.
       PROCEDURE DIVISION.
           GOBACK.
